/*
Task2 Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.
a = 5; b = 7 -> max = 7
a = 2; b = 10 -> max = 10
a = -9; b = -3 -> max = -3 
*/
/*
--------------------------------------------------------------------------------------------------------------------
Вариант решения 1:

int a, b;
Console.Write("Ведите a = ");
int.TryParse(Console.ReadLine()!, out a);
Console.Write("Введите b = ");
int.TryParse(Console.ReadLine()!, out b);

if (a > b)
    Console.Write($"max = {a}");
if (a < b)
    Console.Write($"max = {b}");
--------------------------------------------------------------------------------------------------------------------
Вариант решения 2:

int a, b;
Console.Write("Ведите a = ");
int.TryParse(Console.ReadLine()!, out a);
Console.Write("Введите b = ");
int.TryParse(Console.ReadLine()!, out b);

if (a > b)
    Console.Write($"max = {a} min = {b}");
else
    Console.Write($"max = {b} min = {a}");
--------------------------------------------------------------------------------------------------------------------
*/

/*
Task4 Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.
2, 3, 7 -> 7
44 5 78 -> 78
22 3 9 -> 22
 */
/*
--------------------------------------------------------------------------------------------------------------------
Решение:

Console.WriteLine("Введите 3 числа: ");
int a, b, c;
Console.Write("Ведите a = ");
int.TryParse(Console.ReadLine()!, out a);
Console.Write("Введите b = ");
int.TryParse(Console.ReadLine()!, out b);
Console.Write("Введите c = ");
int.TryParse(Console.ReadLine()!, out c);
int max = a;
if (b > a)
    max = b;
if (c > a)
    max = c;
Console.WriteLine($"max = {max}");
--------------------------------------------------------------------------------------------------------------------
*/

/*Task6 Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).
4 -> да
-3 -> нет
7 -> нет
*/

/*
int N;
Console.Write("Число чётное? Ведите число: ");
bool flag = int.TryParse(Console.ReadLine()!, out N);

if (flag)
{
    if (N % 2 == 0)
        Console.Write($"{N} -> да");  
    else
        Console.Write($"{N} -> нет");
}
else
    Console.Write("Неверный ввод");

    --------------------------------------------------------------------------------------------------------------------
*/

/*
Task8 Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.
5 -> 2, 4
8 -> 2, 4, 6, 8
*/

/* int N;
Console.Write($"Введите число: ");
int.TryParse(Console.ReadLine()!, out N);

for (int i = 2; i <= N; i += 2)
    Console.Write($"{i} "); 
--------------------------------------------------------------------------------------------------------------------    
*/
